export const questions = [
    {
        question: "Что такое JavaScript?",
        answer: "Язык программирования, который используется для создания интерактивных веб-страниц и не только.",
    },
    {
        question: "Что такое TypeScript?",
        answer: "Язык программирования, расширяющий JavaScript статической типизацией.",
    },
    {
        question: "Что такое Docker?",
        answer: "Платформа для запуска приложений в изолированных контейнерах.",
    },
    {
        question: "Что такое SQL?",
        answer: "Язык для работы с реляционными базами данных.",
    },
    {
        question: "Что такое PRIMARY KEY?",
        answer: "Первичный ключ — поле или набор полей, однозначно идентифицирующих запись в таблице.",
    },
    {
        question: "Что такое API?",
        answer: "Интерфейс, через который разные программы взаимодействуют друг с другом.",
    },
    {
        question: "Что такое Git?",
        answer: "Система контроля версий, которая помогает отслеживать изменения в коде.",
    },
    {
        question: "Что такое Node.js?",
        answer: "Среда выполнения JavaScript вне браузера.",
    },
    {
        question: "Что такое Promise в JavaScript?",
        answer: "Объект, представляющий результат асинхронной операции, который станет доступен сейчас или позже.",
    },
    {
        question: "Что такое HTTP?",
        answer: "Протокол обмена данными между клиентом и сервером в вебе.",
    },
];