export const testQuestions = [
    {
        question: "Для чего используется DNS?",
        options: [
            "А) Для шифрования HTTP-запросов",
            "Б) Для преобразования доменного имени в IP-адрес",
            "В) Для хранения файлов сайта",
            "Г) Для обработки SQL-запросов",
        ],
        correctOption: "Б",
    }, {
        question: "Что такое IP-адрес?",
        options: [
             "А) Адрес, используемый для идентификации узла в IP-сети",
            "Б) Название языка программирования",
            "В) Пароль для доступа к сайту",
            "Г) Тип HTTP-запроса",
        ],
        correctOption: "А",
    }, {
        question: "3. Для чего используется TCP?",
        options: [
            "А) Для создания HTML-страниц",
            "Б) Для преобразования доменов в IP-адреса",
            "В) Для надёжной и упорядоченной передачи данных между узлами",
            "Г) Для хранения данных в таблицах",
        ],
        correctOption: "В",
    }, {
        question: "4. Что происходит при установлении TCP-соединения?",
        options: [
            "А) Браузер удаляет кеш",
            "Б) Сервер создаёт HTML-файл",
            "В) DNS автоматически отключается",
            "Г) Стороны выполняют рукопожатие для установления соединения",
        ],
        correctOption: "Г",
    }, {
        question: "Что такое HTTPS?",
        options: [
            "А) Протокол передачи файлов без соединения",
            "Б) HTTP, защищённый с помощью TLS",
            "В) Язык разметки веб-страниц",
            "Г) Система управления базами данных",
        ],
        correctOption: "Б",
    },

];